# Space_CountAvZones

## Description
Returns count of available zones of the space tool

```pascal
FUNCTION Space_CountAvZones : INTEGER;
```

```python

def vs.Space_CountAvZones():
    return INTEGER
```

## Examples
```pascal
resultN := Space_CountAvZones;
```
```python
import vs

# Returns count of available zones of the space tool.
count = vs.Space_CountAvZones()
vs.Message('Space_CountAvZones returned: ' + str(count))
```

## Version
Availability: from Vectorworks 2014

## Category
* SpaceObjectCoreTools